Catalogs/РассылкиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РассылкиСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРассылки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРассылокСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРассылки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СледующаяПопытка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполненоПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/РассылкаСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РассылкаСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолучательАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолучательПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вложения</Name>
					<Comment>Массив вложений письма</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСообщенияIMAP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРассылки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПостановкиВОчередь</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполненоПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Универсальное время в миллисекундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РассылкаСообщений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РассылкиСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтчетныйПериодСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособОтправки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОтправкиСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыРассылки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/РассылкиСообщений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Конструктор данных заполнения нового элемента справочника
//
// Возвращаемое значение:
//  Структура - свойства:
// * Наименование - Строка - наименование элемента справочника
// * ВидРассылки - ПеречислениеСсылка.ВидыРассылокСообщений - вид рассылки
// * ДатаРассылки - Дата - дата и время запускарассылки
// * УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектроннойПочты - учетная запись, с которой выполняется рассылка
// Также содержит  свойства из НовыйПараметрыОтправкиПисем().
//
Функция НовыйДанныеЗаполнения() Экспорт
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Наименование", "");
	ДанныеЗаполнения.Вставить("ВидРассылки", Перечисления.ВидыРассылокСообщений.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("ДатаРассылки", ТекущаяУниверсальнаяДата());
	ДанныеЗаполнения.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка());
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

// Конструктор параметров отправки электронных писем
//
// Возвращаемое значение:
//  Структура - параметры отправки электронных писем:
// * ДозироватьОтправкуПисем - Булево - признак дозирования отправки электронных писем
// * ПисемВПорции - Число - количество электронных писем в порции
// * ПаузаМеждуПорциямиПисем - Число - пауза между порциями электронных писем
// * ПисемВСессии - Число - количество электронных писем в сессии
// * ПаузаМеждуСессиямиОтправкиПисем - Число - пауза между сессиями отправки электронных писем
// * КоличествоПопытокОтправкиПисьма - Число - количество попыток отправки электронного письма
//
Функция НовыйПараметрыОтправкиПисем() Экспорт
	
	ПараметрыОтправкиПисем = Новый Структура;

	ПараметрыОтправкиПисем.Вставить("ДозироватьОтправкуПисем",         Истина);
	ПараметрыОтправкиПисем.Вставить("ПисемВПорции",                    5);
	ПараметрыОтправкиПисем.Вставить("ПаузаМеждуПорциямиПисем",         15);
	ПараметрыОтправкиПисем.Вставить("ПисемВСессии",                    100);
	ПараметрыОтправкиПисем.Вставить("ПаузаМеждуСессиямиОтправкиПисем", 300);
	
	ПараметрыОтправкиПисем.Вставить("КоличествоПопытокОтправкиПисьма",
		РегистрыСведений.РассылкаСообщений.КоличествоПопытокОтправкиПисьма());
	
	Возврат ПараметрыОтправкиПисем;
	
КонецФункции

// Создает новую рассылку сообщений
//
// Параметры:
//  ДанныеЗаполнения - Структура - см. НовыйДанныеЗаполнения()
// 
// Возвращаемое значение:
// СправочникСсылка.РассылкиСообщений- ссылка на новый элемент справочника
//
Функция НоваяРассылка(ДанныеЗаполнения) Экспорт
	
	//Если предыдущая рассылка перенесена на следующий день, то надо и новой рассылке установить СледующаяПопытка
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РассылкаСообщений.СледующаяПопытка КАК СледующаяПопытка
	|ИЗ
	|	Справочник.РассылкиСообщений КАК РассылкаСообщений
	|ГДЕ
	|	НЕ РассылкаСообщений.ПометкаУдаления
	|	И НЕ РассылкаСообщений.Завершена
	|	И РассылкаСообщений.СледующаяПопытка <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РассылкаСообщений.ДатаРассылки УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		СледующаяПопытка = Выборка.СледующаяПопытка;
		Если СледующаяПопытка > ТекущаяДатаСеанса() Тогда
			ДанныеЗаполнения.Вставить("СледующаяПопытка", Выборка.СледующаяПопытка);
		КонецЕсли;
	КонецЕсли;
	
	ЭлементСправочника = СоздатьЭлемент();
	ЭлементСправочника.Заполнить(ДанныеЗаполнения);
	
	Попытка
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементСправочника);
	Исключение
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось записать новую рассылку сообщений по причине:
				|%1'"),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(
			РассылкаСообщений.ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.РассылкиСообщений,
			,
			ТекстСообщения);
		Возврат Неопределено;
	КонецПопытки; 
	
	Возврат ЭлементСправочника.Ссылка;
	
КонецФункции

// Получает список незавершенных рассылок, по которым не установлен признак Завершена
// 
// Параметры:
//  ВидРассылки - ПеречислениеСсылка.ВидыРассылокСообщений - вид рассылки
//
// Возвращаемое значение:
// Массив из СправочникСсылка.РассылкиСообщений - список незавершенных рассылок
//
Функция НезавершенныеРассылки(ВидРассылки = Неопределено) Экспорт
	
	Если Не ЕстьПравоНаРассылки() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РассылкиСообщений.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РассылкиСообщений КАК РассылкиСообщений
	|ГДЕ
	|	НЕ РассылкиСообщений.ПометкаУдаления
	|	И НЕ РассылкиСообщений.Завершена
	|	И &ОтборВидРассылки
	|
	|УПОРЯДОЧИТЬ ПО
	|	РассылкиСообщений.ДатаРассылки";
	
	// Установим отбор по виду рассылки
	Если ВидРассылки = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборВидРассылки", "ИСТИНА")
	Иначе
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&ОтборВидРассылки",
			"РассылкиСообщений.ВидРассылки = &ВидРассылки");
		Запрос.УстановитьПараметр("ВидРассылки", ВидРассылки);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Определяет все завершенные рассылки (нет записей с ожиданием), по которым признак "Завершена" еще не установлен,
// и устанавливает его.
//
Процедура ЗавершитьОтправленныеРассылки() Экспорт
	
	НезавершенныеРассылки = НезавершенныеРассылки();
	
	Если Не ЗначениеЗаполнено(НезавершенныеРассылки) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		// Блокируем элементы справочника, а также очередь рассылки по этим рассылкам
		Блокировка = Новый БлокировкаДанных;
		ТаблицаРассылок = Новый ТаблицаЗначений;
		ТаблицаРассылок.Колонки.Добавить("РассылкаСообщений", Новый ОписаниеТипов("СправочникСсылка.РассылкиСообщений"));
		Для Каждого Рассылка Из НезавершенныеРассылки Цикл
			ТаблицаРассылок.Добавить().РассылкаСообщений = Рассылка;
		КонецЦикла;
		
		ЭлементБлокировки = Блокировка.Добавить("Справочник.РассылкиСообщений");
		ЭлементБлокировки.ИсточникДанных = ТаблицаРассылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "РассылкаСообщений");
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.РассылкаСообщений");
		ЭлементБлокировки.ИсточникДанных = ТаблицаРассылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("РассылкаСообщений", "РассылкаСообщений");
		
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СостояниеРассылкиСообщений.РассылкаСообщений КАК РассылкаСообщений
		|ПОМЕСТИТЬ ФактическиНезавершенные
		|ИЗ
		|	РегистрСведений.РассылкаСообщений КАК СостояниеРассылкиСообщений
		|ГДЕ
		|	СостояниеРассылкиСообщений.РассылкаСообщений В (&НезавершенныеРассылки)
		|	И СостояниеРассылкиСообщений.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыРассылки.Ожидание)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	РассылкаСообщений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РассылкиСообщений.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РассылкиСообщений КАК РассылкиСообщений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ФактическиНезавершенные КАК ФактическиНезавершенные
		|		ПО РассылкиСообщений.Ссылка = ФактическиНезавершенные.РассылкаСообщений
		|ГДЕ
		|	РассылкиСообщений.Ссылка В (&НезавершенныеРассылки)
		|	И ФактическиНезавершенные.РассылкаСообщений ЕСТЬ NULL";
		
		Запрос.УстановитьПараметр("НезавершенныеРассылки", НезавершенныеРассылки);
		
		ВыборкаКЗавершению = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаКЗавершению.Следующий() Цикл
			
			РассылкаОбъект = ВыборкаКЗавершению.Ссылка.ПолучитьОбъект();
			РассылкаОбъект.Завершена = Истина;
			
			Попытка
				РассылкаОбъект.Записать();
			Исключение
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не удалось завершить рассылку сообщений ""%1"" по причине:
						|%2'"),
						ВыборкаКЗавершению.Ссылка,
						ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьЖурналаРегистрации(
					РассылкаСообщений.ИмяСобытияЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Предупреждение,
					Метаданные.Справочники.РассылкиСообщений,
					ВыборкаКЗавершению.Ссылка,
					ТекстСообщения);
			КонецПопытки; 
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			РассылкаСообщений.ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры 

// Проверяет, есть ли право на изменение рассылок сообщений
//
// Возвращаемое значение:
//  Булево - Истина, если есть право на изменение рассылок сообщений
//
Функция ЕстьПравоНаРассылки() Экспорт
	Возврат ПравоДоступа("Редактирование", Метаданные.Справочники.РассылкиСообщений);
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗаблокироватьРассылкуДляОтправки(Рассылка) Экспорт
	
	Попытка
		ЗаблокироватьДанныеДляРедактирования(Рассылка);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Процедура РазблокироватьРассылкуДляОтправки(Рассылка) Экспорт
	
	РазблокироватьДанныеДляРедактирования(Рассылка);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
